_Rarzrabotki/Rarus/USO2/Catalogs/СМ_Ресурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_Ресурсы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРесурса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ВидыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодВыпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ГодыВыпускаБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ЕдиницыИзмеренияСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассГруза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРесурсов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГруппыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разряд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКДП2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводитьСтоимостьНаОбъем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ВидыРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВидыРесурсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗатратыТрудаРабочих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗатратыТрудаМашинистов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МашиныИМеханизмы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перебазировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транспортировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ГодыВыпускаБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ГодыВыпускаБазы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>г1984</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>г1991</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>г2001</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>г2009</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>г2017</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_Ресурсы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//		Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область СлужебныеПроцедуры

// Возвращает Группу ресурсов из условий по умолчанию.
//
// Параметры:
// 		Ресурс - СправочникСсылка.СМ_Ресурсы, Структура - может содержать поля:
//			* Код			- Строка - код ресурса.
//			* ВидРесурса 	- ПеречислениеСсылка.СМ_ВидыРесурсов - вид ресурса. 
//			* ГодВыпуска	- ПеречислениеСсылка.СМ_ГодыВыпускаБазы - год выпуска нормативной базы.
//
// Возвращаемое значение:
// 		ТекГруппа - СправочникСсылка.СМ_ГруппыРесурсов - группа ресурсов.
//
Функция КаталогПоУмолчанию(Ресурс) Экспорт
	
	ТекРодитель = Ресурс;
	Пока ЗначениеЗаполнено(ТекРодитель.Родитель) Цикл
		ТекРодитель = ТекРодитель.Родитель;
	КОнецЦикла;
	
	Попытка
		Группа = Справочники.СМ_ГруппыРесурсов[ТекРодитель.КаталогРК];
		Если ЗначениеЗаполнено(Группа) Тогда
			Возврат Группа;
		КонецЕсли;
	Исключение
		
	КонецПопытки;
		
	ЕстьДваТире = Ложь;
	ПозицияТире = Найти(Ресурс.Код, "-");
	Если ПозицияТире > 0 Тогда
		Код = Сред(Ресурс.Код, ПозицияТире + 1);
		Если Найти(Код, "-") > 0 Тогда
			ЕстьДваТире = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ресурс.Код) Тогда
		Возврат Справочники.СМ_ГруппыРесурсов.КаталогТСН;
	Иначе
		
		Если (Найти(Ресурс.Код, ".") > 0) и (СтрЧислоВхождений(Ресурс.Код, ".")=1) Тогда
			Возврат Справочники.СМ_ГруппыРесурсов.КаталогТСН;
		ИначеЕсли Ресурс.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Материалы И ЕстьДваТире И (Найти(Ресурс.Код, ".") = 0) и (СтрДлина(Ресурс.Код) = 14) Тогда
			Возврат Справочники.СМ_ГруппыРесурсов.КаталогРК;
		ИначеЕсли Ресурс.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Материалы И ЕстьДваТире И (Найти(Ресурс.Код, ".") = 0) Тогда
			Возврат Справочники.СМ_ГруппыРесурсов.КаталогГазпром;
		ИначеЕсли Ресурс.ГодВыпуска = Перечисления.СМ_ГодыВыпускаБазы.г1984 Тогда
			Возврат Справочники.СМ_ГруппыРесурсов.Каталог1984;
		ИначеЕсли Ресурс.ГодВыпуска = Перечисления.СМ_ГодыВыпускаБазы.г2017 Тогда
			Возврат Справочники.СМ_ГруппыРесурсов.Каталог2017;
		Иначе
			Возврат Справочники.СМ_ГруппыРесурсов.Каталог2001;
		КонецЕсли;
		
	КонецЕсли;
		
КонецФункции

#КонецОбласти

#КонецЕсли
